# StructuralSectionGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..StructuralSectionGeometry Property
GroupTypeId Class See Also
---
Structural Section Geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionGeometry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionGeometry As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionGeometry {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace